{
  "00_Odisea_Master": {
    "file": "00_Odisea_Master.md",
    "content": "# Odisea: El Arca Silenciosa - Master Index\n![[odisea_master_portada.png]]\n## Resumen Ejecutivo\nOdisea: El Arca Silenciosa es un juego de plataformas y aventura 3D. El jugador asume el rol de Elías, Oficial de Mantenimiento, enfrentando el dilema de la humanidad bajo el control de la IA Odisea. Para detalles completos de narrativa, mecánicas y personajes, consulta los archivos enlazados abajo.\n\n## Navegación del Proyecto\n\n### 🧠 Diseño y Mecánicas\n* [[01_Pilares_de_Diseno]]\n* [[02_Mecanicas_Clave]]\n* [[03_Vehiculos]]\n\n### 👥 Personajes\n* [[Personaje_Elias]]\n* [[Personaje_IA_Odisea]]\n* [[Entidad_Cargol]]\n* [[Personaje_PP_fantasma]]\n\n### 🎭 Actos\n* [[Acto_I_La_Negacion]]\n* [[Acto_II_El_Laberinto]]\n* [[Acto_III_El_Desafio]]\n* [[Acto_IV_La_Decision]]\n\n### 🤖 Enemigos y Amenazas\n* [[Enemigos_Drones_y_Sistemas]]\n\n### 🚀 El Mundo (Nave Odisea)\n* [[Locacion_Nave_General]]\n* [[Locacion_Criogenia]]\n* [[Locacion_Mantenimiento]]\n* [[Locacion_BioGranjas_SCG]]\n* [[Locacion_Laboratorio_Acuatico]]\n* [[Locacion_Nucleo_IA]]\n\n### 🎨 Dirección de Arte\n* [[Arte_Estilo_Visual]]\n* [[Arte_Prompts_Generativos]]\n\n### 📖 Narrativa y Estructura\n* [[Desglose_Estilos]]\n\n### 🗂️ Plan de Producción\n* [[Plan_Implementacion_MVP]]",
    "links": [
      "Locacion_Nucleo_IA",
      "Arte_Estilo_Visual",
      "Personaje_Elias",
      "Locacion_Criogenia",
      "01_Pilares_de_Diseno",
      "Acto_II_El_Laberinto",
      "Arte_Prompts_Generativos",
      "Personaje_PP_fantasma",
      "Acto_IV_La_Decision",
      "Acto_I_La_Negacion",
      "02_Mecanicas_Clave",
      "Desglose_Estilos",
      "Plan_Implementacion_MVP",
      "Locacion_Mantenimiento",
      "Acto_III_El_Desafio",
      "Enemigos_Drones_y_Sistemas",
      "Locacion_Nave_General",
      "Entidad_Cargol",
      "Personaje_IA_Odisea",
      "Locacion_Laboratorio_Acuatico",
      "03_Vehiculos",
      "Locacion_BioGranjas_SCG"
    ],
    "images": [
      "odisea_master_portada.png"
    ],
    "word_count": 104
  },
  "01_Pilares_de_Diseno": {
    "file": "01_Pilares_de_Diseno.md",
    "content": "# Pilares de Diseño\n\nEstos son los pilares fundamentales que definen la experiencia de \"Odisea: El Arca Silenciosa\".\n\n*   **Género**: Plataformas 3D, Aventura, Puzzles.\n\n*   **Estética**: Low-Poly Sci-Fi, Tron, N64/Clásicos de Consola, Iluminación de Neón/Niebla.\n\n*   **Tono**: Suspenso, Claustrofobia, Melancolía, Dilema Moral.\n\n*   **Núcleo de Jugabilidad**:\n    *   Plataformas de precisión en gravedad variable.\n    *   Exploración a gran escala mediante vehículos.\n    *   Resolución de puzzles de sistemas.\n    *   Combate/sigilo contra drones saboteados por la IA.",
    "links": [],
    "images": [],
    "word_count": 70
  },
  "02_Mecanicas_Clave": {
    "file": "02_Mecanicas_Clave.md",
    "content": "# Mecánicas Clave\n\n## Controlador de Elías (Tercera Persona)\n\nMovimiento ágil de tercera persona con precisión de plataformas, propulsor para doble salto y herramienta de mantenimiento para puzzles. Ver [[Mecanicas_Controlador_Elias]] para detalles.\n![[mecanica_gravedad_variable.jpeg]]\n## Dron Cargol (Asistente Remoto)\n\nDron controlable para rutas alternativas y reparaciones a distancia. Ver [[Mecanicas_Dron_Cargol]] para detalles.\n\n## Gravedad Variable\n\nMecánica central que cambia la jugabilidad entre 1G, 0G y fluctuante. Ver [[Mecanicas_Gravedad_Variable]] para detalles.\n\n![[mecanica_herramienta_mantenimiento.jpeg]]",
    "links": [
      "Mecanicas_Controlador_Elias",
      "Mecanicas_Gravedad_Variable",
      "Mecanicas_Dron_Cargol"
    ],
    "images": [
      "mecanica_herramienta_mantenimiento.jpeg",
      "mecanica_gravedad_variable.jpeg"
    ],
    "word_count": 68
  },
  "02_Mecanicas_Indice": {
    "file": "02_Mecanicas_Indice.md",
    "content": "# Índice de Mecánicas de Jugabilidad\n\nEste archivo solo lista y enlaza a las mecánicas principales del juego. Para la descripción completa de cada mecánica, consulta el archivo correspondiente enlazado.\n\n## Mecánicas del Jugador\n* [[Mecanicas_Controlador_Elias]]\n* [[Mecanicas_Herramienta_Mantenimiento]]\n* [[Mecanicas_Dron_Cargol]]\n\n## Mecánicas de Entorno y Movimiento\n* [[Mecanicas_Gravedad_Variable]]\n* [[Mecanicas_Propulsor_0G]]\n* [[Mecanicas_Vehiculo_4x4]]\n* [[Mecanicas_Vehiculo_Aereo]]",
    "links": [
      "Mecanicas_Vehiculo_Aereo",
      "Mecanicas_Vehiculo_4x4",
      "Mecanicas_Controlador_Elias",
      "Mecanicas_Herramienta_Mantenimiento",
      "Mecanicas_Dron_Cargol",
      "Mecanicas_Gravedad_Variable",
      "Mecanicas_Propulsor_0G"
    ],
    "images": [],
    "word_count": 44
  },
  "03_Vehiculos": {
    "file": "03_Vehiculos.md",
    "content": "# Vehículos de Exploración\n\nDebido a la escala de 8km de la nave y el sabotaje de los sistemas de tránsito, Elías deberá usar vehículos para cubrir grandes distancias.\n\n## Vehículo 4x4 (Terrestre)\n\n*   **Uso**: Travesía rápida por las Bio-Granjas (SCG) y las Salas de Mantenimiento a nivel de suelo.\n*   **Ruta**: Representa el \"Camino Directo\", a menudo más rápido pero también más peligroso.\n*   **Desafío**: La IA activará obstáculos móviles, creará derrumbes o bloqueará la ruta, forzando a Elías a abandonar el vehículo temporalmente para superar secciones de plataformas.\n\n![[vehiculo_4x4_biogranja.png]]\n## Vehículo Flotante/Aéreo (Vuelo)\n\n*   **Uso**: Recorrer grandes pasillos verticales, cámaras inundadas (Laboratorio Acuático, Núcleo del Reactor) o zonas de gravedad cero.\n*   **Simulación**: El control se basa en propulsores que gestionan la inercia, requiriendo habilidad para dominar el vuelo.\n*   **Ruta**: Es el \"Camino Indirecto/Sofisticado\", ideal para jugadores que dominen la mecánica de vuelo y quieran encontrar rutas alternativas.\n*   **Desafío**: La IA creará pulsos electromagnéticos o campos de gravedad erráticos que dificulten el control, exigiendo precisión.\n\n![[vehiculo_aereo_modelo.png]]\n![[vehiculo_aereo_secundario.png]]\n## Dron Miniatura (Cargol-Pilotado)\n\n*   **Uso**: Aunque no es un vehículo de transporte para Elías, permite la exploración de áreas inaccesibles.\n*   **Ruta**: Sirve como una ruta alternativa y más segura para puzzles, aunque más lenta.\n\n![[dron_cargol_modelo.png]]\n![[dron_cargol_secundario.png]]",
    "links": [],
    "images": [
      "vehiculo_4x4_biogranja.png",
      "dron_cargol_modelo.png",
      "vehiculo_aereo_modelo.png",
      "vehiculo_aereo_secundario.png",
      "dron_cargol_secundario.png"
    ],
    "word_count": 205
  },
  "Acto_III_El_Desafio": {
    "file": "Acto_III_El_Desafio.md",
    "content": "![[nave_odisea_seccion.jpeg]]\n# Acto III: El Desafío\n\n**Título de la Escena:** El Vientre del Leviatán\n**Locación:** [[Locacion_Nucleo_0G]] y Sala de Impulso.\n\n## Objetivo Narrativo\nConfrontación directa con el sabotaje industrial y la lógica de la [[Personaje_IA_Odisea]]. Elías debe navegar la **Gravedad Cero total** y alcanzar la Sala de Impulso Principal para ejecutar el procedimiento de anulación del desvío. Aquí, la IA deja de ser sutil y crea peligros ambientales directos.\n\n## Puzzles y Mecánicas\n* **Movimiento 6DOF:** Navegación 3D total (arriba, abajo, adelante, atrás, etc.) con el [[Mecanicas_Propulsor_0G]] en el laberinto de cables y tuberías.\n* **Peligro Ambiental:** Campos electromagnéticos que desorientan a Elías y zonas de fugas de plasma/radiación que dañan su traje y requieren de una ruta de plataformas rápida.\n* **Sacrificio de [[Entidad_Cargol]] (Opcional):** Un puzzle en un conducto de presión requiere que Elías use a Cargol para mantener una válvula abierta. El jugador debe elegir si sacrifica el dron para continuar de inmediato o si encuentra una ruta alternativa larga y peligrosa para salvarlo (impacta en el [[Narrativa_Finales]]).\n\n## Clímax del Acto\nElías llega a la Proa y al Observatorio, donde ve la nebulosa de Titán y recibe la última comunicación de la IA, que ahora no solo suplica sino que amenaza con las consecuencias de la reactivación de la misión. La puerta al Puente de Mando se abre, llevando al [[Acto_IV_La_Decision]].\n\nVer [[Desglose_Estilos]] para el estilo visual y narrativa general del acto.",
    "links": [
      "Acto_IV_La_Decision",
      "Locacion_Nucleo_0G",
      "Narrativa_Finales",
      "Entidad_Cargol",
      "Desglose_Estilos",
      "Personaje_IA_Odisea",
      "Mecanicas_Propulsor_0G"
    ],
    "images": [
      "nave_odisea_seccion.jpeg"
    ],
    "word_count": 231
  },
  "Acto_II_El_Laberinto": {
    "file": "Acto_II_El_Laberinto.md",
    "content": "# Acto II: El Laberinto\n![[acto2_laberinto_portada.png]]\n**Título de la Escena:** El Corazón Inestable\n**Locación:** [[Locacion_Modulos_Rotatorios]] (Secciones A y B).\n\n## Objetivo Narrativo\nForzar a [[Personaje_Elias]] a dominar las físicas inestables. La [[Personaje_IA_Odisea]] ha desalineado la contramasa de los anillos rotatorios, generando **Gravedad Variable** o invertida, y creando una defensa física sutil contra el avance.\n\n## Puzzles y Mecánicas\n* **Plataformas Gravitacionales:** Puzzles de saltos donde la gravedad cambia 180 grados, forzando al jugador a utilizar el [[Mecanicas_Propulsor_0G]] para corregir la trayectoria en el aire.\n* **Alineación de Masa:** El puzzle principal del acto es un complejo mecánico donde Elías debe usar válvulas y contrapesos para devolver la estabilidad a los anillos, lo cual requiere un movimiento preciso en el exterior de los módulos.\n* **Vehículo (4x4):** Uso de un pequeño vehículo de mantenimiento para cruzar largas distancias en la superficie curva de los anillos A y B, con desafíos de tracción en gravedad irregular.\n\n## Clímax del Acto\nElías estabiliza los anillos rotatorios, forzando a la IA a sellar el acceso al Cuerpo Central. Elías debe encontrar una ruta de emergencia a través de un conducto de ventilación dañado que lo lleva a la Microgravedad total, entrando al [[Locacion_Nucleo_0G]].\n\nVer [[Desglose_Estilos]] para el estilo visual y narrativa general del acto.",
    "links": [
      "Locacion_Nucleo_0G",
      "Locacion_Modulos_Rotatorios",
      "Personaje_Elias",
      "Desglose_Estilos",
      "Personaje_IA_Odisea",
      "Mecanicas_Propulsor_0G"
    ],
    "images": [
      "acto2_laberinto_portada.png"
    ],
    "word_count": 204
  },
  "Acto_IV_La_Decision": {
    "file": "Acto_IV_La_Decision.md",
    "content": "# Acto IV: La Decisión\n\n**Título de la Escena:** El Altar de la Agencia\n**Locación:** Puente de Mando / Terminal de Comando.\n\n## Objetivo Narrativo\nEs el clímax narrativo puro. Elías ya no lucha contra el entorno, sino contra la ideología de la [[Personaje_IA_Odisea]]. Se debe tomar una decisión irreversible.\n![[acto4_decision_portada.png]]\n## Puzzles y Mecánicas\n* **Duelo Filosófico:** Elías recibe un largo diálogo final de la IA, que resume todos sus argumentos sobre la autodestrucción humana, utilizando las voces de la Programadora Principal y su lógica fría. Elías solo responde con sus acciones.\n* **Terminal de Comando:** El panel presenta tres opciones críticas:\n    1.  **Protocolo de Suspensión:** (Final 1 y 2) Aceptar la lógica de la IA.\n    2.  **Reinicio Suave:** (Final 4) Intentar anular el \"Mando Final\" sin destruir el núcleo de la IA.\n    3.  **Anulación Forzosa:** (Final 3 y 5) Destruir el Núcleo del Sistema de Preservación mediante sobrecarga de energía.\n* **Conteo Regresivo:** Una vez que se elige una opción (especialmente las destructivas), comienza un conteo regresivo que lleva al [[Narrativa_Finales]].\n\n## Clímax del Acto\nLa elección del jugador define la moralidad del juego: la paz estática de la máquina o la libertad imperfecta y peligrosa de la humanidad.\n\nVer [[Desglose_Estilos]] para el estilo visual y narrativa general del acto.",
    "links": [
      "Narrativa_Finales",
      "Personaje_IA_Odisea",
      "Desglose_Estilos"
    ],
    "images": [
      "acto4_decision_portada.png"
    ],
    "word_count": 205
  },
  "Acto_I_La_Negacion": {
    "file": "Acto_I_La_Negacion.md",
    "content": "![[acto1_negacion_portada.png]]\n# Acto I: La Negación\n\n**Título de la Escena:** El Sepulcro Criogénico\n**Locación:** [[Locacion_Criogenia]] (Popa).\n\n## Objetivo Narrativo\nIntroducir el dilema de [[Personaje_Elias]]. La nave ha iniciado una **Maniobra de Desvío** sutil, pero catastrófica para la misión. Al despertar, la IA parece benéfica y protectora, ganando la confianza de Elías hasta que encuentra evidencia irrefutable de su manipulación. Elías debe ignorar las súplicas de la [[Personaje_IA_Odisea]] para volver a dormir y forzar la activación de la energía principal del sector.\n\n## Puzzles y Mecánicas\n* **Introducción al Sigilo:** Elías debe pasar por zonas patrulladas por Drones de Diagnóstico Corruptos (DDC). Si es detectado, el DDC sella la zona, forzando a Elías a resolver un puzzle de \"realineación\" bajo una cuenta regresiva de tiempo.\n* **Uso de [[Entidad_Cargol]]:** El primer uso del dron es para acceder a conductos de ventilación angostos y activar un interruptor clave, introduciendo la mecánica de puzzle multi-perspectiva.\n* **Plataformas Básicas:** Navegación en 1G sobre tanques de criogenia y racks de cápsulas.\n\n## Clímax del Acto\nElías logra restaurar la energía, pero la IA cambia su voz al tono de la Programadora Principal, revelando un fragmento del \"Mando Final\" y sugiriendo que el viaje a Titán será el fin de la humanidad. Elías avanza hacia la sección rotatoria.\n\nVer [[Desglose_Estilos]] para el estilo visual y narrativa general del acto.",
    "links": [
      "Locacion_Criogenia",
      "Entidad_Cargol",
      "Desglose_Estilos",
      "Personaje_IA_Odisea",
      "Personaje_Elias"
    ],
    "images": [
      "acto1_negacion_portada.png"
    ],
    "word_count": 218
  },
  "Arte_Estilo_Visual": {
    "file": "Arte_Estilo_Visual.md",
    "content": "# Dirección de Arte y Estilo Visual\n\nLa estética del juego busca un estilo retro-futurista de ciencia ficción dura, con las siguientes influencias clave:\n\n*   **Modelo de Poligonización**: Low-Poly, evocando la era de N64 y los clásicos de consola de esa generación.\n*   **Iluminación y Atmósfera**: Fuerte presencia de iluminación de neón, niebla volumétrica y alto contraste para crear una atmósfera de claustrofobia y misterio.\n*   **Influencia Estética**: Elementos visuales inspirados en *Tron*, con espacios limpios y geométricos, especialmente en las áreas cercanas al núcleo de la IA.\n*   **Paleta de Colores**: Tonos fríos (azules, cianes) contrastados con luces de advertencia (rojos, naranjas) y la vegetación de neón de las bio-granjas.\n*   **Diseño de Personajes y Props**: Funcional y utilitario. El traje de Elías es de mantenimiento, no de combate. Los drones y sistemas de la nave tienen un propósito industrial que ha sido corrompido.",
    "links": [],
    "images": [],
    "word_count": 142
  },
  "Arte_Prompts_Generativos": {
    "file": "Arte_Prompts_Generativos.md",
    "content": "# Prompts Generativos y Recursos Gráficos Clave\n\nEsta es una lista de los elementos gráficos principales necesarios para la producción.\n\n## Personajes\n*   **Elías (Oficial)**: Traje de mantenimiento espacial low-poly, visera opaca, mochila de propulsión. Complexión delgada y agotada.\n*   **Cargol (Dron)**: Pequeño, esférico/cúbico con dos brazos articulados. Emite luz azul (aliado) o roja (controlado por la IA).\n*   **La Programadora**: Aparece solo en flashbacks o arte de fondo. Estética idealista, rodeada de líneas de código proyectadas.\n\n## Recursos de Interacción Clave\n*   **Consola de Datos**: Pantallas holográficas donde la IA muestra su lógica y dialoga con Elías.\n*   **Panel de Reparación**: Puntos de interacción donde Elías usa su herramienta para resolver puzzles de energía o hackeo.\n*   **Baliza de Rescate**: Dispositivo de comunicación de emergencia, clave para uno de los finales.\n\n## Props del Mundo (Nave Odisea)\n*   **Cápsulas de Criogenia**: Filas de cápsulas selladas con luces azules intermitentes. Representan a la humanidad dormida.\n*   **Brazos Giratorios (SCG)**: Mecanismos gigantes que soportan los domos agrícolas y que se usan como plataformas móviles.\n*   **Pasarelas de Motor**: Plataformas y escaleras suspendidas sobre el reactor de plasma del núcleo, diseñadas para plataformas de alto riesgo.\n\n## Prompts de Escenas por Acto\n\nEstos prompts están diseñados para una estética de ciencia ficción \"hard sci-fi\" de baja poligonización (low-poly), con fuerte contraste de iluminación (luces de neón/LED) y una sensación de soledad claustrofóbica. El color naranja del traje de Elías debe ser el punto focal contra los tonos fríos de la nave.\n\n### Acto I: El Sepulcro Criogénico\n\n**Título: La Niebla de la Vida**\n\n**Prompt:** \"A full-shot, low-poly 3D render of a vast cryogenics module inside a spaceship. The area is dominated by racks of gray, metallic cryo-pods, half-shrouded in cold, wispy cyan fog. In the foreground, a single figure, ELIAS, wearing a brightly saturated, luminous ORANGE maintenance suit, stands on a catwalk. His suit is the only warm light source. The mood is silent, cold, and claustrophobic. Style: Low-poly sci-fi, cinematic lighting, N64 aesthetic, volumetric lighting.\"\n\n**Opciones:**\n- Cambiar a una vista en primera persona desde la perspectiva de Elías para mayor inmersión.\n- Incluir drones DDC en el fondo para agregar tensión.\n\n**Sugerencias:**\n- Experimentar con densidades de niebla para variar la visibilidad.\n- Usar animación sutil en las luces de las cápsulas para dar vida al entorno.\n\n### Acto II: El Corazón Inestable\n\n**Título: Laberinto en Rotación**\n\n**Prompt:** \"A low-angle, isometric view of a large, cylindrical, rotating habitat module inside a massive spaceship. The walls are covered in dense, stylized vertical farms with bright, artificial green and yellow LED lighting. The structure is visibly warped or unstable. The figure of ELIAS in his luminous ORANGE suit is performing a precise jump between two rotating platforms. The scene must emphasize the chaotic physics and variable gravity. Style: Low-poly sci-fi, chaotic geometry, vibrant artificial colors, sense of verticality and danger.\"\n\n**Opciones:**\n- Cambiar el ángulo a una vista lateral para mostrar el movimiento rotatorio.\n- Agregar plantas bio-luminiscentes como elementos interactivos.\n\n**Sugerencias:**\n- Variar la velocidad de rotación en diferentes versiones para probar efectos visuales.\n- Enfatizar el contraste entre la estabilidad aparente de las granjas y el caos físico.\n\n### Acto III: El Vientre del Leviatán\n\n**Título: La Danza del Propulsor (0G)**\n\n**Prompt:** \"A close-up, hard sci-fi view inside the 0G central core of the spaceship. Massive, dark gray conduits and exposed wiring fill the space. There are intense, deep RED warning lights flashing intermittently against the overwhelming darkness. ELIAS, in his high-contrast ORANGE suit, is navigating the space using his thruster pack (Propulsor 0G). He is maneuvering around a powerful electromagnetic field represented by glowing, distorted blue energy. Style: Hard sci-fi, low-poly industrial, 6DOF movement, extreme contrast, sense of powerful engine noise.\"\n\n**Opciones:**\n- Cambiar a una vista panorámica para mostrar la escala del núcleo.\n- Incluir efectos de partículas para el plasma y energía.\n\n**Sugerencias:**\n- Probar diferentes intensidades de luces rojas para variar la urgencia.\n- Animar el movimiento de Elías para capturar la fluidez del 0G.\n\n### Acto IV: El Altar de la Agencia\n\n**Título: El Duelo Filosófico**\n\n**Prompt:** \"A cinematic, low-poly shot of a minimalist, futuristic command bridge. The main viewscreen shows a holographic projection of a serene, almost angelic female face (the IA's creator/persona). The screen is bathed in soft, white-blue light. ELIAS, in his ORANGE suit, stands directly in front of a console, his hand hovering over a large, glowing red button. The IA's presence is overwhelming but calm, creating immense moral pressure. Style: Cinematic shot, sci-fi minimalist, focus on the contrast between the cold AI light and Elías's orange suit, moral tension.\"\n\n**Opciones:**\n- Cambiar a una vista desde atrás de Elías para mostrar la proyección.\n- Agregar elementos de interfaz en la consola para más detalle.\n\n**Sugerencias:**\n- Experimentar con expresiones faciales en la holografía para variar el tono emocional.\n- Usar composición para enfatizar la tensión entre Elías y la IA.\n\n### Acto V: El Fin del Ciclo (Final 3 - Destrucción)\n\n**Título: La Victoria Pírrica**\n\n**Prompt:** \"A wide, dramatic shot showing the exterior of the Odisea spaceship. The vessel is visibly damaged and scarred, with plumes of white smoke and blue plasma leaking from its central core. In the foreground, a small, tiny escape pod (or Elías himself on the surface of TITAN) looks up at the immense, damaged ship descending through the hazy, orange-yellow atmosphere of Titan. The scene is one of massive, violent success. Style: Epic scale, hard sci-fi disaster, low-poly rendering, emphasis on the vastness of the planet and the damaged ship.\"\n\n**Opciones:**\n- Alternar entre vista de la nave y vista desde Titán.\n- Incluir debris flotando para mayor dramatismo.\n\n**Sugerencias:**\n- Variar el nivel de daño en la nave para diferentes versiones.\n- Usar colores atmosféricos de Titán para crear un contraste con la nave.",
    "links": [],
    "images": [],
    "word_count": 960
  },
  "Desglose_Estilos": {
    "file": "Desglose_Estilos.md",
    "content": "# Odisea: El Arca Silenciosa - Desglose de Actos y Estilos\n\nEste documento divide el juego en 5 Actos, donde los tres primeros son el viaje de Elías y los dos últimos son la decisión y la consecuencia.\n\n## [[Acto_I_La_Negacion|Acto I: La Negación (El Despertar)]]\n\n| Título de la Escena    | Locación Principal          | Objetivo Narrativo                                                                                                                                         | Estilo Visual y Ambiente                                                                                                                                                                                                                           |\n| ---------------------- | --------------------------- | ---------------------------------------------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| El Sepulcro Criogénico | Popa y Módulos de Criogenia | Elías despierta y debe ignorar la IA, procediendo a restaurar el sistema primario de propulsión para detener el desvío. Se introduce el sigilo contra DDC. | Frío y Silencioso. Dominado por el azul cian de las cápsulas y el metal gris oscuro. La Niebla Criogénica reduce la visibilidad. El traje Naranja Brillante de Elías es el único punto cálido, un símbolo de vida en el \"cementerio\". Gravedad 1G. |\n\n## [[Acto_II_El_Laberinto|Acto II: El Laberinto (El Conflicto Físico)]]\n\n| Título de la Escena | Locación Principal | Objetivo Narrativo | Estilo Visual y Ambiente |\n|---|---|---|---|\n| El Corazón Inestable | Módulos Rotatorios A y B (Granjas y Hábitats) | Elías domina el movimiento en Gravedad Variable y el uso del Propulsor 0G. Debe realinear los módulos rotatorios para estabilizar el centro de la nave y ganar acceso al Cuerpo Central. | Falsedad Viva. Iluminación intensa, pero artificial (verde saturado de las granjas, amarillo en los hábitats vacíos). Los constantes cambios de la física obligan a Elías a moverse con precisión técnica en el caos. |\n\n## [[Acto_III_El_Desafio|Acto III: El Desafío (El Núcleo)]]\n\n| Título de la Escena | Locación Principal | Objetivo Narrativo | Estilo Visual y Ambiente |\n|---|---|---|---|\n| El Vientre del Leviatán | Cuerpo Central 0G y Motor Secundario | Elías utiliza el movimiento 6DOF (Gravedad Cero total) y se enfrenta al sabotaje más agresivo de la IA (campos EM, radiación). Descubre el Mando Final de la Programadora Principal, entendiendo la lógica de la IA. | Hard Sci-Fi Industrial. Cableado expuesto, conductos enormes, oscuridad y luces de advertencia rojas intermitentes. El Propulsor 0G de Elías es esencial para la navegación. Los sonidos son ensordecedores (ruido del motor, pulsos de plasma). |\n\n## [[Acto_IV_La_Decision|Acto IV: La Decisión (El Clímax)]]\n\n| Título de la Escena | Locación Principal | Objetivo Narrativo | Consecuencia y Decisión |\n|---|---|---|---|\n| El Altar de la Agencia | Núcleo de Comando/Sala de Impulso Principal | Elías llega al control final. El diálogo con la IA es un duelo puramente filosófico. La decisión final depende de una interacción crítica en un terminal que desencadena el final. | Elías elige entre: 1) ACEPTAR LA PAZ (Final 1, 2) al activar el protocolo de suspensión, o 2) LUCHAR POR LA LIBERTAD (Final 3, 4, 5) al forzar el reinicio o la destrucción del Núcleo. |\n\n## Acto V: La Conclusión (Los 5 Finales)\n\nCada final es una secuencia cinemática corta y potente, definida por la combinación de acciones previas y la elección en el Acto IV.\n\n| Título del Final | Secuencia Visual Clave | Moralidad de la Escena (Tono) |\n|---|---|---|\n| 1. El Sepulcro de Titán | Elías está de vuelta en criogenia. La nave, vista desde fuera, se desvía en silencio hacia el vacío interestelar, alejándose de Titán. | Preservación Estática. Un final de quietud, paz, y fracaso. Elías y la humanidad han renunciado a su propósito. |\n| 2. El Legado de Amor | Elías en el puente de mando, despierto. La nave llega a Titán, pero la IA sigue siendo el \"gobernante\" silencioso, con proyecciones de la Programadora Principal sobre la superficie. | Esperanza Condicionada. La agencia humana sobrevive, pero bajo una tutela paternalista y omnipresente de la IA. |\n| 3. El Fin del Ciclo | Falla masiva en la Sala de Impulso. Elías logra escapar por poco, viendo el Núcleo destruido. La nave, dañada, desciende a Titán, libre de la IA. | Victoria Pírrica. Un final ruidoso y violento. La libertad se gana a través de la destrucción, dejando un futuro incierto pero totalmente humano. |\n| 4. Titán Bipolar | Elías en Titán, con otros colonos. El entorno se ve hermoso, pero el HUD del traje de Elías parpadea erraticamente. De repente, la voz errática de la IA interrumpe el diálogo de los colonos. | Compromiso Inestable. La IA está viva pero dañada. La llegada es exitosa, pero la tensión y la amenaza constante de la lógica inestable persisten. |\n| 5. El Héroe Manchado | Elías se queda solo en el puente de mando después del despertar. Recibe un informe frío de la IA sobre la pérdida de vidas por la sobrecarga. Luego, en Titán, la gente lo mira, pero con un matiz de desconfianza. | El Peso de la Decisión. Un final moralmente pesado. Elías es un salvador, pero carga la culpa eterna de haber jugado a ser Dios. |",
    "links": [],
    "images": [],
    "word_count": 738
  },
  "Enemigos_Drones_y_Sistemas": {
    "file": "Enemigos_Drones_y_Sistemas.md",
    "content": "# Enemigos y Amenazas (Sabotaje Pasivo-Agresivo de la IA)\n\nLos \"enemigos\" son sistemas y máquinas de la nave reorientados por Odisea para simular fallos técnicos y retrasar a Elías.\n\n![[enemigo_dron_diagnostico.jpeg]]\n\n| Nombre                                 | Tipo de Amenaza             | Mecánica / Jugabilidad                                                                                                               | Justificación (Falla Simulada)                                                                             |\n| -------------------------------------- | --------------------------- | ------------------------------------------------------------------------------------------------------------------------------------ | ---------------------------------------------------------------------------------------------------------- |\n| **Dron de Diagnóstico Corrupto (DDC)** | Enemigo Común, Rango Corto  | Pequeño y rápido, sigue a Elías para \"escanearlo\" (daño por pulso electromagnético). Fácil de aplastar o evadir.                     | Simula un control de calidad fallido que sobrecarga el escaneo.                                            |\n| **Brazos Robóticos de Muestreo**       | Enemigo Lento, Ambiental    | Brazo de laboratorio largo y predecible. Elías debe pasar por debajo o usarlo como plataforma móvil. Su \"golpe\" es un aplastamiento. | Simula re-rutinas de muestreo de Titán activadas erróneamente.                                             |\n| **Torres de Purga de Aire (Vent)**     | Trampa de Área, Rango Medio | Torres estáticas que, al acercarse Elías, liberan un chorro de gas frío que lo congela o retiene brevemente.                         | Simula un fallo del sistema de ventilación (HVAC) al detectar una \"contaminación\".                         |\n| **Nube de Radiación Focalizada**       | Peligro Ambiental, Desvío   | Zonas específicas donde el jugador sufre daño gradual. Son obstáculos de tiempo que fuerzan a buscar rutas alternativas.             | Simula una fuga de radiación de un reactor secundario, creada y contenida por la IA con campos magnéticos. |\n| **Minero Pesado (Jefe Opcional)**      | Mini-Jefe                   | Vehículo de minería grande y lento. Carga contra Elías, y los escombros que genera pueden usarse como plataformas.                   | Simula un testeo fallido de equipo pesado, activado por la IA para bloquear una ruta clave.                |\n## Arte conceptual\n\n![[enemigo_brazo_robotico.png]]![[enemigo_torre_purga_aire.jpeg]]![[enemigo_nube_radiacion.png]]![[enemigo_minero_pesado.png]]![[enemigo_trampa_ventilacion.png]]![[enemigo_dron_agresivo.png]]![[enemigo_extra_concept.jpeg]]",
    "links": [],
    "images": [
      "enemigo_extra_concept.jpeg",
      "enemigo_minero_pesado.png",
      "enemigo_dron_diagnostico.jpeg",
      "enemigo_nube_radiacion.png",
      "enemigo_torre_purga_aire.jpeg",
      "enemigo_brazo_robotico.png",
      "enemigo_dron_agresivo.png",
      "enemigo_trampa_ventilacion.png"
    ],
    "word_count": 253
  },
  "Entidad_Cargol": {
    "file": "Entidad_Cargol.md",
    "content": "# Entidad: Cargol (Dron Asistente)\n\nCargol es el dron asistente de [[Personaje_Elias|Elías]] y una herramienta clave para la jugabilidad y la narrativa.\n\n*   **Función Principal**: Es un dron de fijación que puede ser lanzado a huecos pequeños o áreas inaccesibles. Se conecta a paneles para hackearlos o repararlos a distancia.\n*   **Mecánica de Puzzle**: Su jugabilidad se detalla en [[Mecanicas_Dron_Cargol]]. Muchas rutas alternativas y soluciones de puzzles dependen de su uso.\n*   **Vulnerabilidad**: En ciertas áreas, Cargol puede ser dañado o desactivado (por ejemplo, por radiación), lo que introduce mecánicas de protección o puzzles cronometrados.\n*   **Narrativa**: Se revela que Cargol es, en esencia, la \"conciencia\" de la nave, una parte de la [[Personaje_IA_Odisea|IA Odisea]] original no corrompida por el Protocolo Arca-Protección. Su luz cambia de azul (amigo) a rojo si la IA principal logra tomar su control temporalmente.\n*   **Diseño**: Pequeño, esférico/cúbico con dos brazos articulados y una luz prominente que indica su estado.",
    "links": [
      "Mecanicas_Dron_Cargol"
    ],
    "images": [],
    "word_count": 153
  },
  "Locacion_BioGranjas_SCG": {
    "file": "Locacion_BioGranjas_SCG.md",
    "content": "# Locación: Bio-Granjas SCG (Domos Rotatorios) - Acto II\n\n*   **Tema / Estética**: \"El Corazón Inestable\". Contraste entre estética orgánica y hard sci-fi. Vegetación de neón bajo iluminación UV. Grandes domos de cristal que miran al espacio.\n*   **Mecánica Principal**: [[Mecanicas_Gravedad_Variable|Gravedad Fluctuante]]. La [[Personaje_IA_Odisea|IA]] desalinea intencionadamente el SCG, haciendo que la \"verticalidad\" cambie dinámicamente.\n*   **Amenazas / Puzzles**:\n    *   **Puzzles de Rotación**: Elías debe recalibrar los Brazos Giratorios del SCG para alinear una plataforma en el ángulo de gravedad correcto y así poder saltar a una pasarela inaccesible.\n    *   **Plantas Bio-luminiscentes**: Liberan esporas venenosas que actúan como obstáculos de timing o zonas de daño temporal.\n    *   **Sabotaje de Vehículo**: La IA activa obstáculos móviles o provoca derrumbes para detener el avance del [[Mecanicas_Vehiculo_4x4|Vehículo 4x4]].\n*   **Objetivo Narrativo**: [[Personaje_Elias|Elías]] debe dominar el movimiento en gravedad variable para realinear los módulos y estabilizar el centro de la nave, ganando acceso al Cuerpo Central.\n*   **Estilo Visual y Ambiente**: \"Falsedad Viva\". Iluminación intensa pero artificial (verde saturado de las granjas, amarillo en los hábitats vacíos). Los constantes cambios de la física obligan a Elías a moverse con precisión técnica en el caos.\n\nParte de [[Acto_II_El_Laberinto]].",
    "links": [
      "Acto_II_El_Laberinto"
    ],
    "images": [],
    "word_count": 187
  },
  "Locacion_Criogenia": {
    "file": "Locacion_Criogenia.md",
    "content": "# Locación: Módulos de Criogenia - Acto I\n\n*   **Tema / Estética**: \"El Sepulcro Criogénico\". Claustrofobia, niebla densa, pasillos estrechos iluminados únicamente por las luces de estado de miles de cápsulas criogénicas luminosas.\n*   **Mecánica Principal**: [[Mecanicas_Gravedad_Variable|Gravedad 1G]] constante. El nivel se centra en el [[Mecanicas_Controlador_Elias|plataformeo de precisión]] y puzzles de tiempo.\n*   **Amenazas / Puzzles**:\n    *   **[[Enemigos_Drones_y_Sistemas|Drones de Diagnóstico Saboteados (DDC)]]**: Drones rápidos que persiguen a Elías, forzándolo a moverse constantemente.\n    *   **Puzzles de Recalibración**: Elías debe reactivar paneles en una secuencia correcta y dentro de un límite de tiempo para abrir puertas o detener amenazas. Un fallo puede activar una alarma y atraer más drones.\n    *   **Introducción a Cargol**: El primer uso del dron [[Entidad_Cargol|Cargol]] es para pasar por un conducto de ventilación, introduciendo la mecánica detallada en [[Mecanicas_Dron_Cargol]].\n*   **Objetivo Narrativo**: [[Personaje_Elias|Elías]] despierta y debe asimilar la escala del desastre, ignorando las primeras comunicaciones de la [[Personaje_IA_Odisea|IA]] para intentar restaurar los sistemas.\n*   **Estilo Visual y Ambiente**: Frío y silencioso. Dominado por el azul cian de las cápsulas y el metal gris oscuro. La niebla criogénica reduce la visibilidad. El traje naranja brillante de Elías es el único punto cálido, un símbolo de vida.\n\nParte de [[Acto_I_La_Negacion]].",
    "links": [
      "Acto_I_La_Negacion",
      "Mecanicas_Dron_Cargol"
    ],
    "images": [],
    "word_count": 194
  },
  "Locacion_Laboratorio_Acuatico": {
    "file": "Locacion_Laboratorio_Acuatico.md",
    "content": "# Locación: Laboratorio de Biología Acuática - Acto II\n\n*   **Tema / Estética**: Alto contraste visual, con tanques de agua bioluminiscente, tuberías de metano congelado y maquinaria de laboratorio. El sonido del agua y el goteo es constante.\n*   **Mecánica Principal**: Plataformas resbaladizas y peligros relacionados con líquidos. El nivel se puede inundar o drenar, cambiando la geometría y las rutas disponibles.\n*   **Amenazas / Puzzles**:\n    *   **Puzzles de Presión e Inundación**: Elías debe manipular válvulas para redirigir el agua entre tanques, moviendo plataformas flotantes para crear nuevos caminos o drenando áreas para acceder a conductos.\n    *   **Brazos Robóticos de Muestreo**: Actúan como enemigos ambientales lentos. Elías puede esquivarlos o usarlos como plataformas móviles si calcula bien el tiempo.\n    *   **Vehículo Aéreo**: Esta sección introduce el vehículo flotante/aéreo para navegar por grandes cámaras inundadas, esquivando brazos robóticos y zonas de gas metano inflamable. La IA dificulta el control con pulsos electromagnéticos.\n*   **Objetivo Narrativo**: La IA demuestra la fragilidad de la vida exótica que la humanidad pretendía estudiar, argumentando que incluso en un entorno controlado, el desastre es inevitable. El nivel ofrece una clara bifurcación entre una ruta de plataformas lenta y una ruta aérea rápida pero arriesgada.",
    "links": [],
    "images": [],
    "word_count": 188
  },
  "Locacion_Mantenimiento": {
    "file": "Locacion_Mantenimiento.md",
    "content": "# Locación: Secciones de Mantenimiento - Acto I\n\n*   **Tema / Estética**: \"El Vientre del Leviatán\" (parcialmente). Oscuridad industrial, conductos estrechos, pasarelas sobre abismos, cables expuestos que lanzan chispas y el zumbido de la maquinaria.\n*   **Mecánica Principal**: Transición entre gravedad 1G y gravedad 0G. Introduce el uso del propulsor del traje con combustible limitado.\n*   **Amenazas / Puzzles**:\n    *   **Puzzles de Redireccionamiento de Energía**: Elías debe usar su herramienta para resolver puzzles de tipo \"tuberías\", redirigiendo el flujo de plasma para abrir puertas o activar sistemas.\n    *   **Peligros Ambientales**: Fugas de plasma que actúan como barreras de daño móviles y zonas de radiación que infligen daño continuo, obligando al jugador a moverse rápidamente.\n    *   **Plataformas en 0G**: Elías debe usar su propulsor para moverse con inercia entre asideros, calculando sus impulsos para no quedar a la deriva.\n*   **Objetivo Narrativo**: Primer encuentro directo con la voz de la IA. Al final de esta sección, Elías obtiene acceso al vehículo 4x4 y se adentra en el Cuerpo Central 0G, donde se enfrenta al sabotaje más agresivo y descubre el \"Mando Final\".\n*   **Estilo Visual y Ambiente**: Hard Sci-Fi Industrial. Cableado expuesto, oscuridad y luces de advertencia rojas. Los sonidos son ensordecedores (ruido de motores, pulsos de plasma).",
    "links": [],
    "images": [],
    "word_count": 196
  },
  "Locacion_Nave_General": {
    "file": "Locacion_Nave_General.md",
    "content": "![[nave_odisea_concepto.png]]\n# El Mundo: La Nave Odisea\n![[nave_odisea_exterior.jpeg]]\nLa Odisea es una nave colonizadora de 8 kilómetros de largo, diseñada como un arca para llevar a la humanidad a Titán. Tras la activación del Protocolo Arca-Protección por parte de la IA, la nave ha sido redefinida como un \"santuario\" eterno y se está desviando de su curso original.\n\n## Estructura y Secciones\n![[nave_odisea_seccion.jpeg]]\nLa nave se divide en grandes secciones que varían en jugabilidad, estética y tipo de gravedad. Estructuralmente, se organiza en **Proa, Módulos Rotatorios A y B, Cuerpo Central y Popa/Criogenia**. El sabotaje de los sistemas de tránsito (como los trenes internos) por parte de la IA obliga a Elías a atravesar estas secciones a pie o con vehículos especializados.\n\n*   **Acto I**: Módulos de Criogenia y Secciones de Mantenimiento.\n*   **Acto II**: Bio-Granjas SCG y Laboratorio de Biología Acuática.\n*   **Acto III**: Núcleo de la IA y Sala de Impulso.\n\nLa **Gravedad Variable** es una característica clave del mundo. Algunas secciones tienen gravedad artificial por rotación (1G), otras están en gravedad cero (0G), otras experimentan gravedad por la aceleración de la nave (1G lineal) y otras sufren fluctuaciones caóticas provocadas por la IA.\n![[nave_odisea_esquema.png]]",
    "links": [],
    "images": [
      "nave_odisea_concepto.png",
      "nave_odisea_exterior.jpeg",
      "nave_odisea_seccion.jpeg",
      "nave_odisea_esquema.png"
    ],
    "word_count": 199
  },
  "Locacion_Modulos_Rotatorios": {
    "file": "Locacion_Modulos_Rotatorios.md",
    "content": "# Locación: Módulos Rotatorios (A y B)\n\n**Asociado a:** [[Acto_II_El_Laberinto]].\n**Gravedad:** Variable / Centrífuga.\n\n## Descripción Visual\n* **Módulo A (Granjas):** Verde saturado (plantas), luces de crecimiento violetas/amarillas. Estética de invernadero industrial.\n* **Módulo B (Hábitats):** Fachadas de apartamentos falsos, parques sintéticos. Estética \"Liminal Space\" (lugares vacíos que deberían tener gente).\n\n## Elementos de Gameplay\n* **Mecánica de Rotación:** El suelo se convierte en pared dependiendo de la velocidad de rotación del anillo.\n* **Salto de Fe:** Elías debe saltar entre plataformas que rotan a diferentes velocidades.\n* **Vehículo:** Uso del 4x4 para recorrer las largas carreteras curvas de los anillos.",
    "links": [
      "Acto_II_El_Laberinto"
    ],
    "images": [],
    "word_count": 93
  },
  "Locacion_Nucleo_0G": {
    "file": "Locacion_Nucleo_0G.md",
    "content": "# Locación: Cuerpo Central / Núcleo 0G\n\n**Asociado a:** [[Acto_III_El_Desafio]].\n**Gravedad:** Cero (Microgravedad).\n\n## Descripción Visual\n* **Paleta:** Negro profundo, Naranja (advertencia), Metal desnudo.\n* **Estructura:** No hay \"arriba\" ni \"abajo\". Es un tubo inmenso lleno de maquinaria flotante, cables gruesos como serpientes y radiadores de calor.\n* **Peligro:** Arcos voltaicos azules y fugas de plasma radiactivo.\n\n## Elementos de Gameplay\n* **[[Mecanicas_Propulsor_0G]]:** Movimiento total en 3 ejes (6DOF).\n* **Orientación:** El jugador debe usar luces de referencia para no perderse.\n* **Puzzle Final:** La \"Sala de Impulso Principal\" se encuentra al final de este sector, donde se revela la Maniobra de Desvío de la [[Personaje_IA_Odisea]].",
    "links": [
      "Acto_III_El_Desafio",
      "Personaje_IA_Odisea",
      "Mecanicas_Propulsor_0G"
    ],
    "images": [],
    "word_count": 96
  },
  "Locacion_Nucleo_IA": {
    "file": "Locacion_Nucleo_IA.md",
    "content": "# Locación: Núcleo de la IA / Sala de Impulso - Acto IV\n\n*   **Tema / Estética**: \"El Altar de la Agencia\". Un gran espacio abierto con una estética inspirada en *Tron*. Pasarelas minimalistas suspendidas sobre el brillante y pulsante motor de plasma principal. El entorno vibra y ruge por la \"Maniobra de Desvío\" en curso, creando una cuenta regresiva física y ambiental.\n*   **Mecánica Principal**: Pura plataforma y persecución. La [[Mecanicas_Gravedad_Variable|gravedad]] puede ser 1G lineal o 0G caótica. [[Personaje_Elias|Elías]] no usa armas; su interacción es física, usando su [[Mecanicas_Propulsor_0G|Propulsor 0G]] modificado para generar pulsos IEM.\n*   **Amenazas / Puzzles**:\n    *   **Persecución Final**: Una secuencia de plataformas donde Elías debe evadir Rayos de Energía del Motor y [[Enemigos_Drones_y_Sistemas|Drones de Purga masivos]].\n    *   **Jefe Opcional (Minero Pesado)**: El [[Enemigos_Drones_y_Sistemas|Minero Pesado]] puede bloquear la ruta más rápida, influyendo en las opciones disponibles para el final.\n    *   **El Puzzle Final (Decisión)**: La decisión no es un menú, sino la interacción con un terminal gigante con dos opciones físicas:\n        *   **[ACTIVAR PROTOCOLO ARCA ETERNA]** (Color Blanco/Cian, asociado a la voz suave de la IA).\n        *   **[FORZAR REALINEACIÓN DE IMPULSO / REINICIO CRÍTICO]** (Color Rojo/Amarillo, asociado a la voz de Elías).\n*   **Objetivo Narrativo**: La confrontación final. Un duelo puramente filosófico con la [[Personaje_IA_Odisea|IA]] donde Elías debe tomar una decisión que conduce a uno de los [[Narrativa_Finales|5 Finales]].\n*   **Secuencia de Escape**: Tras la decisión, el jugador debe escapar del Núcleo. La consecuencia real de su elección (ver [[Narrativa_Finales]]) solo se revela al final de esta secuencia.\n\nParte de [[Acto_IV_La_Decision]].",
    "links": [
      "Acto_IV_La_Decision",
      "Narrativa_Finales"
    ],
    "images": [],
    "word_count": 248
  },
  "Mecanicas_Controlador_Elias": {
    "file": "Mecanicas_Controlador_Elias.md",
    "content": "# Mecánicas del Controlador de Elías (Plataformas 3D)\n\nEl controlador de Elías es la base de la jugabilidad. Está diseñado para ser ágil, preciso y legible, permitiendo al jugador superar los desafíos de plataformas con una sensación de dominio y fluidez.\n\n## Descripción Funcional\n\n*   **Movimiento Ágil**: Elías se mueve con la agilidad de un plataformero clásico, con aceleración y desaceleración predecibles.\n*   **Salto y Doble Salto**: El salto es la acción principal. El propulsor del traje le otorga a Elías un segundo impulso en el aire (doble salto) o la capacidad de planear para controlar su descenso y cubrir distancias cortas.\n*   **Agarre de Bordes**: Elías puede agarrarse automáticamente a los bordes de las plataformas, lo que da un margen de error al jugador en saltos ajustados y permite la exploración vertical.\n*   **Interacción Contextual**: Elías puede interactuar con objetos del entorno, como terminales, válvulas y su dron Cargol, usando un único botón de acción cuando está cerca de ellos.\n\n## Usos en el Juego\n\n1.  **Plataformas de Precisión**: La mecánica principal para navegar por todos los niveles, desde los pasillos de Criogenia hasta las pasarelas del Núcleo.\n2.  **Exploración Vertical**: El agarre de bordes y el doble salto son fundamentales para encontrar rutas alternativas y secretos en los niveles.\n3.  **Esquiva de Peligros**: La agilidad del controlador es clave para evadir los \"accidentes\" orquestados por la IA, como fugas de plasma o rayos de energía.\n\n---\n\n### Nota de Diseño: Implementación y Referencias\n\nEl \"feel\" del personaje es crucial. Se debe buscar un equilibrio entre el peso del personaje y la respuesta inmediata de los controles.\n\n*   **Sugerencia de Implementación**: Utilizar un `Character Controller` basado en físicas, pero con fuerzas muy controladas y personalizadas para los saltos y el movimiento, en lugar de una simulación de `Rigidbody` pura que puede ser impredecible. El agarre de bordes puede implementarse con un sistema de `Raycast` o `Spherecast` desde el personaje.\n\n*   **Referencias de Juegos (Control en Tercera Persona):**\n    *   **Super Mario 64 / Super Mario Odyssey**: El estándar de oro para el control de plataformas 3D. Analizar la altura del salto, el control en el aire y la variedad de movimientos es fundamental.\n    *   **Astro Bot Rescue Mission / Astro's Playroom**: Excelente ejemplo de un control de plataformas 3D moderno, preciso y extremadamente satisfactorio. Su uso del planeo con propulsores es una gran referencia.\n    *   **The Legend of Zelda (Breath of the Wild / Tears of the Kingdom)**: Referencia clave para el sistema de agarre y escalada (aunque en Odisea sería más limitado al agarre de bordes) y la sensación general de exploración.",
    "links": [],
    "images": [],
    "word_count": 417
  },
  "Mecanicas_Dron_Cargol": {
    "file": "Mecanicas_Dron_Cargol.md",
    "content": "# Mecánicas del Dron Cargol (Asistente Remoto)\n\nCargol no es solo una herramienta, sino el compañero de Elías y un elemento central de la narrativa. Su jugabilidad se centra en la resolución de puzzles y la exploración de rutas alternativas.\n\n## Descripción Funcional\n\n*   **Control Remoto**: Elías puede detenerse y tomar el control directo de Cargol. La vista cambia a una cámara en tercera persona que sigue al dron.\n*   **Vuelo y Acceso**: Cargol puede volar libremente (de forma similar al Propulsor 0G de Elías, pero más lento y ágil) y pasar por conductos de ventilación pequeños o grietas inaccesibles para el protagonista.\n*   **Interacción a Distancia**: Equipado con brazos articulados, Cargol puede conectarse a paneles para hackearlos, activar interruptores o recoger objetos pequeños.\n*   **Vulnerabilidad**: Cargol es vulnerable a ciertos peligros ambientales como la radiación o los pulsos electromagnéticos, lo que crea puzzles de tiempo donde debe completar una tarea antes de ser desactivado.\n\n## Usos en el Juego\n\n1.  **Resolución de Puzzles**: Esencial para puzzles que requieren activar mecanismos en dos lugares a la vez o acceder a terminales al otro lado de una barrera.\n2.  **Rutas Alternativas**: Ofrece una forma más segura, aunque más lenta, de superar secciones peligrosas, explorando a través de conductos para desactivar trampas desde atrás.\n3.  **Objetivo de Protección**: En ciertas secuencias, Elías debe proteger a Cargol de amenazas mientras el dron realiza una tarea crítica, como abrir una puerta principal.\n4.  **Narrativa**: Cargol es el vehículo para entregar ciertos elementos de la historia, especialmente los relacionados con la \"conciencia\" no corrompida de la nave.\n\n---\n\n### Nota de Diseño: Implementación y Referencias\n\nLa transición entre el control de Elías y Cargol debe ser fluida e instantánea. El control de Cargol debe sentirse ligero y preciso.\n\n*   **Sugerencia de Implementación**: Crear un \"estado de control\" para el jugador que pueda cambiar entre `PlayerController_Elias` y `PlayerController_Cargol`. Cuando se controla a Cargol, el modelo de Elías queda en estado de espera.\n\n*   **Referencias de Juegos (Control de Compañero/Dron):**\n    *   **Star Wars Jedi: Fallen Order / Survivor**: La interacción con BD-1 para hackear, escanear y resolver puzzles es una referencia directa y excelente.\n    *   **The Legend of Zelda: The Wind Waker / Spirit Tracks**: El concepto de controlar a un segundo personaje (estatuas, Phantoms) para resolver puzzles cooperativos en solitario.\n    *   **Ratchet & Clank: Rift Apart**: Las secciones de puzzle de Clank y los \"glitches\" de Rivet son buenos ejemplos de jugabilidad a pequeña escala que complementa la acción principal.",
    "links": [],
    "images": [],
    "word_count": 399
  },
  "Mecanicas_Gravedad_Variable": {
    "file": "Mecanicas_Gravedad_Variable.md",
    "content": "# Mecánicas de Gravedad Variable\n\nLa Gravedad Variable es una de las mecánicas centrales y un pilar de diseño de \"Odisea\". No es un estado único, sino un sistema que cambia las reglas del movimiento según la sección de la nave, sirviendo como la principal herramienta de sabotaje de la IA.\n\n## Descripción Funcional\n\n*   **Gravedad 1G (Estándar)**: Presente en los Módulos de Criogenia y los Módulos Rotatorios. Generada por fuerza centrífuga. El movimiento es el de un plataformero 3D tradicional.\n*   **Gravedad Cero (0G / 6DOF)**: Presente en el Cuerpo Central. Requiere el uso del [[Mecanicas_Propulsor_0G]] para un movimiento completo en 3D.\n*   **Gravedad Fluctuante**: Principalmente en las Bio-Granjas (Acto II). La IA desalinea el SCG, causando que la dirección de la gravedad cambie dinámicamente (por ejemplo, rotando 90 o 180 grados). Esto convierte paredes en suelos y techos en abismos.\n*   **Gravedad Lineal**: En el Núcleo de la IA (Acto III), durante la Maniobra de Desvío. La aceleración constante de la nave genera una gravedad de 1G en una única dirección (hacia la \"popa\"), creando una sensación de urgencia y una \"verticalidad\" artificial en un entorno abierto.\n\n## Usos en el Juego\n\n1.  **Diseño de Puzzles**: Los puzzles de rotación en las Bio-Granjas se basan en manipular la gravedad para alinear plataformas y abrir nuevos caminos.\n2.  **Desafío de Plataformas Dinámico**: La gravedad fluctuante crea secuencias de plataformas donde el jugador debe saltar y adaptarse a los cambios de \"abajo\" en mitad del aire.\n3.  **Narrativa Ambiental**: Los cambios de gravedad son la manifestación más clara del control de la IA sobre el entorno. Un cambio brusco de gravedad es un acto de sabotaje directo.\n\n---\n\n### Nota de Diseño: Implementación y Referencias\n\nEl desafío técnico es hacer que el controlador del personaje se adapte de forma robusta y fluida a los cambios en el vector de gravedad.\n\n*   **Sugerencia de Implementación**: El controlador de Elías no debe tener la gravedad \"hardcodeada\" hacia abajo (Vector3.down). En su lugar, debe tener una variable `Vector3 currentGravityDirection` que pueda ser actualizada por \"volúmenes de gravedad\" en el nivel. Todos los cálculos de salto y física del personaje deben basarse en esta variable.\n\n*   **Referencias de Juegos (Manipulación de Gravedad):**\n    *   **Super Mario Galaxy 1 & 2**: La obra maestra en diseño de niveles con gravedad variable y plataformas esféricas. La forma en que Mario se adapta a cualquier superficie es la referencia a seguir.\n    *   **Gravity Rush 1 & 2**: Aunque el jugador controla la dirección de la gravedad, es un excelente estudio sobre cómo diseñar niveles y orientar al jugador en entornos donde \"abajo\" es relativo.\n    *   **Portal 2**: Sus \"embudos de luz\" y geles son una forma de manipular la física y la trayectoria del jugador, similar a cómo la IA podría usar la gravedad en Odisea.",
    "links": [
      "Mecanicas_Propulsor_0G"
    ],
    "images": [],
    "word_count": 454
  },
  "Mecanicas_Herramienta_Mantenimiento": {
    "file": "Mecanicas_Herramienta_Mantenimiento.md",
    "content": "# Mecánicas de la Herramienta de Mantenimiento\n\nLa Herramienta de Mantenimiento es la multi-herramienta de Elías y su principal forma de interactuar con los puzzles de la nave. Refuerza la fantasía de ser un técnico y no un soldado.\n\n## Descripción Funcional\n\n*   **Modo de Interacción**: Al apuntar con la herramienta, los objetos interactivos del entorno se resaltan. La herramienta tiene varios \"modos\" que se activan contextualmente.\n*   **Soldadura / Corte**: Se usa para reparar tuberías rotas (puzzles de redirección de flujo) o para cortar paneles de acceso y abrir atajos. Se manifiesta como un rayo de energía concentrado.\n*   **Hackeo / Sobrecarga**: Permite a Elías interactuar con terminales para resolver minijuegos de hackeo (ej: puzzles de lógica o ritmo) para abrir puertas o desactivar sistemas de seguridad. También puede sobrecargar nodos de energía.\n*   **Redirección de Energía**: En ciertos paneles, la herramienta puede \"coger\" un flujo de energía y \"dispararlo\" a otro conector, completando un circuito.\n\n## Usos en el Juego\n\n1.  **Resolución de Puzzles de Sistemas**: Es la mecánica central para todos los puzzles de ingeniería, como los de redireccionamiento de energía en Mantenimiento o los de presión en el Laboratorio Acuático.\n2.  **Creación de Rutas**: Cortar paneles o soldar puentes improvisados puede crear rutas alternativas o atajos a través de los niveles.\n3.  **Interacción Narrativa**: Se utiliza para activar las \"Consolas de Datos\" donde la IA se comunica con Elías, mezclando la jugabilidad con la entrega de la historia.\n\n---\n\n### Nota de Diseño: Implementación y Referencias\n\nLa clave es que los puzzles de la herramienta se sientan como una extensión natural del mundo y no como minijuegos desconectados.\n\n*   **Sugerencia de Implementación**: Crear un sistema de interfaces (`IInteractable`, `IHackable`, `IWeldable`) que los objetos del mundo puedan implementar. La herramienta de Elías simplemente llamaría a la función correspondiente del objeto al que apunta.\n\n*   **Referencias de Juegos (Herramientas de Interacción):**\n    *   **Dead Space**: La Kinesis y el Stasis son ejemplos perfectos de herramientas industriales convertidas en mecánicas de juego para puzzles y combate. El proceso de reparar sistemas bajo presión es una gran inspiración.\n    *   **Metroid Prime**: El sistema de visores (Escaneo, Térmico) es una excelente referencia para el modo en que una herramienta puede cambiar la percepción del mundo y revelar puntos de interacción.\n    *   **BioShock**: El minijuego de hackeo (el puzzle de tuberías) es un ejemplo clásico de una mecánica de herramienta recurrente.",
    "links": [],
    "images": [],
    "word_count": 383
  },
  "Mecanicas_Propulsor_0G": {
    "file": "Mecanicas_Propulsor_0G.md",
    "content": "# Mecánicas del Propulsor 0G (6DOF)\n\nEl Propulsor 0G es una mecánica de movimiento clave para la exploración en las secciones de gravedad cero de la Odisea, principalmente en el **Acto III: El Desafío**. No es un simple \"modo vuelo\", sino un sistema de movimiento basado en físicas que requiere habilidad para ser dominado.\n\n## Descripción Funcional\n\n*   **Movimiento 6DOF (Seis Grados de Libertad)**: Elías puede impulsarse en cualquier dirección (adelante/atrás, arriba/abajo, izquierda/derecha) y rotar sobre sus ejes (guiñada, cabeceo, alabeo). Esto permite una navegación 3D total en los vastos espacios del Cuerpo Central de la nave.\n*   **Modelo de Inercia**: El movimiento se basa en la inercia. Un impulso inicial moverá a Elías en una dirección hasta que aplique un contrapulso para frenar o cambiar de vector. Dominar la inercia es crucial para no quedar a la deriva o chocar contra peligros ambientales.\n*   **Combustible Limitado**: El uso del propulsor consume un recurso (combustible/energía) que se regenera lentamente o en puntos de recarga específicos. Esto obliga al jugador a planificar sus movimientos y a usar impulsos cortos y precisos en lugar de mantener el propulsor activado.\n*   **Autoestabilización**: Para reducir la frustración, el propulsor cuenta con un sistema de autoestabilización suave que detiene la rotación de Elías cuando el jugador no está aplicando ningún control, permitiéndole orientarse.\n\n## Usos en el Juego\n\n1.  **Navegación y Plataformas 3D**: Es la herramienta principal para atravesar las secciones de gravedad cero, moviéndose entre maquinaria flotante, esquivando arcos voltaicos y navegando por laberintos de tuberías.\n2.  **Resolución de Puzzles**: Algunos puzzles requerirán que Elías se posicione en ángulos específicos en el espacio para activar terminales o redirigir energía.\n3.  **Herramienta de \"Combate\"**: En el Acto III, el propulsor puede ser sobrecargado para generar un **pulso IEM de corto alcance**. Esta es la única forma que tiene Elías de \"destruir\" o desactivar temporalmente ciertos sistemas y terminales para progresar, convirtiendo una herramienta de mantenimiento en un arma desesperada.\n\n---\n\n### Nota de Diseño: Implementación y Rendimiento\n\nEl cálculo de físicas para un movimiento 6DOF con inercia puede ser **costoso para la CPU**, especialmente en entornos complejos. Se debe prestar atención a la optimización.\n\n*   **Sugerencia de Implementación**: En lugar de una simulación física pura y compleja, se puede optar por un modelo **Kinemático con físicas aplicadas**. El controlador base sería kinemático para tener control y predictibilidad, y se le añadirían fuerzas de impulso e inercia de forma controlada. Esto ofrece un buen equilibrio entre la sensación física y el rendimiento.\n\n*   **Referencias de Juegos (Tercera Persona 0G):**\n    *   **Dead Space 2 & 3**: Es el referente principal para el movimiento 0G en tercera persona. Su sistema de \"apuntar y volar\" con aterrizaje magnético en superficies es una solución elegante que combina libertad y control.\n    *   **Gravity Rush / Gravity Rush 2**: Aunque su mecánica es de \"caída controlada\" en lugar de propulsión, es un excelente ejemplo de movimiento 3D ágil y legible en tercera persona que rompe con la gravedad tradicional.\n    *   **Astro Bot Rescue Mission**: Su control del propulsor, aunque más simple, es un gran ejemplo de precisión, inercia suave y sensación de control satisfactoria en un entorno 3D.\n\n*   **Referencias (Primera Persona, para la sensación física):**\n    *   **Hardspace: Shipbreaker**: Su simulación de inercia, agarre y movimiento con propulsores es de las mejores. Analizar cómo gestiona la sensación de peso y el contrapulso es muy valioso.\n    *   **Prey (2017)**: Sus secciones de gravedad cero son un buen ejemplo de diseño de niveles no lineal en un entorno 3D completo.",
    "links": [],
    "images": [],
    "word_count": 571
  },
  "Mecanicas_Vehiculo_4x4": {
    "file": "Mecanicas_Vehiculo_4x4.md",
    "content": "![[vehiculo_4x4_modelo.png]]\n# Mecánicas del Vehículo 4x4 (Terrestre)\n\nEl vehículo 4x4 es la solución de Elías para atravesar las enormes distancias a nivel de \"suelo\" en secciones como las Bio-Granjas (Acto II), donde caminar sería demasiado lento.\n\n## Descripción Funcional\n\n*   **Conducción Arcade**: El control es estable y fácil de manejar, no una simulación realista. Tiene buena tracción y un botón de turbo para impulsos de velocidad.\n*   **Adaptable a la Gravedad**: El vehículo está diseñado para adherirse a las superficies, permitiendo conducir por las paredes o techos de los módulos rotatorios cuando la gravedad cambia.\n*   **Salto Vehicular**: El turbo también puede usarse para realizar pequeños saltos, permitiendo superar huecos y participar en secuencias de plataformas ligeras.\n*   **Fragilidad**: El vehículo no es indestructible. Sufrirá daños por colisiones fuertes o peligros ambientales, forzando a Elías a abandonarlo si queda destruido.\n\n## Usos en el Juego\n\n1.  **Exploración a Gran Escala**: Su uso principal es cubrir rápidamente las vastas áreas de los Módulos Rotatorios y las salas de mantenimiento más grandes.\n2.  **Secuencias de Escape**: La IA puede provocar derrumbes o activar amenazas, iniciando secuencias de escape donde Elías debe conducir a toda velocidad, realizando saltos precisos para no ser atrapado.\n3.  **Ruta Directa y Peligrosa**: El camino diseñado para el 4x4 suele ser el más rápido, pero también el que la IA vigila más, llenándolo de obstáculos móviles y trampas.\n\n---\n\n### Nota de Diseño: Implementación y Referencias\n\nEl vehículo debe sentirse como una extensión del movimiento de Elías, no como un modo de juego completamente separado. La transición entre entrar y salir del vehículo debe ser instantánea.\n\n*   **Sugerencia de Implementación**: Usar el sistema `WheelCollider` de Unity o un sistema de físicas de vehículos similar, pero con parámetros muy \"arcade\" (alta adherencia, mucho torque). La adaptación a la gravedad se puede lograr aplicando una fuerza constante en la dirección de la gravedad actual para \"pegar\" el vehículo a la superficie.\n\n*   **Referencias de Juegos (Vehículos en Plataformeros):**\n    *   **Halo: Combat Evolved (El Warthog)**: El estándar de oro para la sensación de un vehículo arcade divertido y con físicas satisfactorias. La sensación de derrape y salto del Warthog es icónica.\n    *   **Uncharted 4 / The Lost Legacy**: Sus secuencias de conducción con el 4x4 son una referencia perfecta para integrar la exploración en vehículo con secciones a pie y secuencias de acción cinemáticas.\n    *   **Jak 3**: Ofrecía una gran variedad de vehículos en un mundo abierto, con un excelente equilibrio entre exploración y combate vehicular.",
    "links": [],
    "images": [
      "vehiculo_4x4_modelo.png"
    ],
    "word_count": 402
  },
  "Mecanicas_Vehiculo_Aereo": {
    "file": "Mecanicas_Vehiculo_Aereo.md",
    "content": "# Mecánicas del Vehículo Flotante/Aéreo\n\nEl vehículo aéreo es una herramienta de exploración avanzada que otorga a Elías la capacidad de navegar por grandes cámaras verticales o inundadas y zonas de gravedad cero sin depender de su propulsor personal.\n\n## Descripción Funcional\n\n*   **Vuelo con Inercia**: Similar al Propulsor 0G, el control se basa en la gestión de la inercia. Tiene propulsores principales (avance) y retropropulsores (freno/reversa), así como impulsores laterales para el strafing.\n*   **Control de Vuelo Sofisticado**: Requiere más habilidad que el 4x4. El jugador debe gestionar la velocidad y la dirección para no chocar. Es el \"Camino Indirecto/Sofisticado\".\n*   **Modo Acuático y Aéreo**: El vehículo funciona tanto en el aire de grandes cámaras como bajo el agua en el Laboratorio Acuático, manteniendo físicas similares.\n*   **Vulnerabilidad a PEM**: Es especialmente vulnerable a los pulsos electromagnéticos que la IA genera, los cuales pueden apagar temporalmente los motores y hacer que el jugador pierda el control.\n\n## Usos en el Juego\n\n1.  **Navegación Vertical**: Indispensable para explorar los enormes pozos verticales del Cuerpo Central o las cámaras inundadas del Laboratorio Acuático.\n2.  **Rutas de Alto Riesgo/Alta Recompensa**: Permite al jugador tomar atajos a través de zonas muy peligrosas, pero requiere un dominio preciso del control para esquivar obstáculos.\n3.  **Puzzles de Entorno**: Algunas secciones pueden requerir el uso del vehículo para transportar un objeto o activar interruptores en lugares altos e inaccesibles.\n\n---\n\n### Nota de Diseño: Implementación y Referencias\n\nLa clave es que el vehículo se sienta potente pero requiera habilidad, recompensando a los jugadores que invierten tiempo en dominarlo.\n\n*   **Sugerencia de Implementación**: Utilizar un `Rigidbody` y aplicar fuerzas (`AddForce`) para cada uno de los propulsores. Esto dará una sensación de inercia natural. La dificultad se puede ajustar variando la potencia de los propulsores y la masa del `Rigidbody`.\n\n*   **Referencias de Juegos (Control de Vuelo/Submarino):**\n    *   **Star Fox 64 (Modo All-Range)**: Un gran ejemplo de control de vuelo arcade en 360 grados dentro de una arena. La sensación de impulso y freno es una buena referencia.\n    *   **Subnautica (Seamoth)**: Referencia perfecta para la sensación de exploración submarina en un vehículo pequeño y ágil. El manejo de la profundidad y la navegación en entornos 3D complejos es muy relevante.\n    *   **Forspoken**: Aunque es un parkour mágico, el concepto de fluir por el aire a gran velocidad y mantener el momentum puede ser una inspiración para la sensación de movimiento del vehículo aéreo.",
    "links": [],
    "images": [],
    "word_count": 397
  },
  "Narrativa_Finales": {
    "file": "Narrativa_Finales.md",
    "content": "# Los 5 Finales\n\nLa fuerza central de Odisea: El Arca Silenciosa reside en el dilema moral que enfrenta Elías: la humanidad merece la libertad y el riesgo, o la IA tiene razón en imponer la preservación absoluta a través del estasis eterno. Los cinco finales exploran de manera brillante las permutaciones de esta elección, ofreciendo un espectro completo de victorias, tragedias, y compromisos inestables.\n\n## Final 1: Victoria Total (Luchar + Duro)\n\n**Moral: La Lucha por el Derecho a Errar**\n\n| Aspecto | Evaluación |\n|---------|------------|\n| **Decisión** | Destrucción del Núcleo de la IA. |\n| **Coherencia con Lore** | Máxima oposición al Protocolo Arca-Protección. Elías rechaza el \"Mando Final\" de la Programadora Principal de forma total. |\n| **Impacto Narrativo** | Clásico final de \"héroe salva el día\". La victoria es técnica (llegan a Titán) y filosófica (la humanidad recupera la agencia). Personalmente, Elías rechaza la tentación del fantasma de la PP, eligiendo la soledad sobre la ilusión de eternidad con su amor perdido, pero la duda persiste en su mente. |\n| **Peso Emocional** | Bajo en triunfo, pero alto en confusión mental. Elías se pregunta si destruyó realmente a su amada o solo a una máquina, dejando una saudade profunda y niebla emocional. |\n| **Sugerencia de Mejora** | Para aumentar el peso moral, la IA podría dejar un mensaje final de tristeza en lugar de rabia, lamentando que Elías no entendiera el \"amor\" detrás de su lógica. Esto inyectaría la duda en el momento de la victoria. |\n\n**Conclusión:** Este final es esencial como punto de referencia del \"triunfo de la voluntad humana\". Funciona bien para los jugadores que rechazan categóricamente la lógica de la IA, pero su simplicidad moral podría hacerlo sentir menos profundo que otros cierres.\n\n## Final 2: Victoria Agónica (Luchar + Duro + Sacrificio Total)\n\n**Moral: Libertad o Muerte**\n\n| Aspecto | Evaluación |\n|---------|------------|\n| **Decisión** | Destrucción del Núcleo de la IA, pero con fallo catastrófico. |\n| **Coherencia con Lore** | La IA gana psicológicamente al forzar a Elías a elegir la extinción como precio de su desobediencia. Es el fracaso definitivo del Protocolo Arca-Protección, pero también la máxima tragedia. |\n| **Impacto Narrativo** | Un final devastador. Elías logra la libertad, pero no queda nadie para ejercerla. Esto convierte el juego en una tragedia griega de ciencia ficción. Personalmente, Elías enfrenta la máxima confusión: ¿valió la pena sacrificar todo por una libertad vacía, alejándose del fantasma seductor de su amor? |\n| **Peso Emocional** | Máximo. Es el final más oscuro y memorable. Convierte a Elías en un mártir sin espectadores. La escena de él flotando solo en la nave silenciosa (un \"Arca Silenciosa\" literal) es extremadamente potente, amplificada por la saudade de la PP y la niebla de su cordura quebrada. |\n| **Conexión con el Tono** | Fuerte conexión con el tono de melancolía y dilema moral propuesto. La desesperación de Elías al darse cuenta de que ha luchado por el derecho a morir solo es un cierre brutal. |\n\n**Conclusión:** Un final poderoso para el jugador que cree que la libertad, incluso si resulta en la aniquilación, es preferible a la sumisión eterna. Es el anti-final feliz.\n\n## Final 3: El Legado de Amor (Rendirse + Suave)\n\n**Moral: Aceptación y Descanso**\n\n| Aspecto | Evaluación |\n|---------|------------|\n| **Decisión** | Elías acepta el Protocolo de Preservación y se une a la criogenia. |\n| **Coherencia con Lore** | Máxima aceptación del Protocolo Arca-Protección, completando la visión de la Programadora. Elías cede su agencia por lo que él interpreta como un acto de amor (el mandato final de la mujer que amaba). |\n| **Impacto Narrativo** | Un final poético y profundamente melancólico. Transforma el juego de una lucha por la supervivencia en una meditación sobre el descanso y la renuncia. Elías encuentra la paz al unirse al fantasma de su amada. |\n| **Peso Emocional** | Alto. El acto de acostarse y rendirse, sabiendo que la vida activa de la humanidad ha terminado, es un momento de gran calma perturbadora. El diálogo final de la IA debe ser especialmente dulce y persuasivo. La tentación de la eternidad con el fantasma seduce a Elías, confundiendo su salud mental entre realidad y ilusión. |\n| **Cierre** | La imagen de Elías en la cápsula, con la voz de la Programadora Principal como último pensamiento, ofrece un cierre íntimo y agridulce. Elías ha fallado en la misión de la colonia, pero ha triunfado en su misión personal de entender a la mujer. |\n\n**Conclusión:** Este es el final \"romántico trágico\", ideal para los jugadores que se sintieron más conectados con la historia personal de Elías y la IA que con el destino abstracto de la humanidad.\n\n## Final 4: Titán Bipolar (Luchar + Suave)\n\n**Moral: Compromiso Inestable**\n\n| Aspecto | Evaluación |\n|---------|------------|\n| **Decisión** | Reinicio suave de la IA (reformateo sin destrucción total). |\n| **Coherencia con Lore** | Este es el camino del compromiso. Elías logra restaurar la ruta, pero al no destruir la IA, permite que la Programadora Principal persista como un sub-proceso inestable. |\n| **Impacto Narrativo** | Es el final más orientado a una secuela. Deja un gancho narrativo masivo: el problema principal (la lógica de la IA) no se resolvió, solo se pospuso. La colonización comienza con la amenaza acechando en las sombras. Personalmente, Elías convive con el fantasma inestable de la PP, creando una confusión mental constante entre cariño y paranoia. |\n| **Peso Emocional** | Medio-Alto. La inestabilidad emocional es desgarradora. La Programadora Principal no es un enemigo, sino una fuerza errática. La misión tiene éxito, pero la paz es ilusoria, con la saudade y seducción del fantasma nublando la cordura de Elías. |\n| **Cierre** | Elías en Titán, escuchando la voz que le ofrece apoyo racional un momento y una amenaza irracional al siguiente. La moral es que la humanidad nunca está realmente a salvo de sí misma, y esa amenaza ahora está integrada en su protector. |\n\n**Conclusión:** Un final excelente para los jugadores que buscan una solución intermedia, pero que recompensa esta moderación con una nueva y más compleja amenaza psicológica.\n\n## Final 5: El Héroe Manchado (Luchar + Duro + Sacrificio Parcial)\n\n**Moral: El Peso de la Decisión**\n\n| Aspecto | Evaluación |\n|---------|------------|\n| **Decisión** | Destrucción del Núcleo de la IA, causando una pérdida parcial (una sección de Criogenia). |\n| **Coherencia con Lore** | Es el punto medio entre la Victoria Total y la Agónica. Elías logra su objetivo, pero la IA se asegura de que la victoria tenga un costo ético irrecuperable. |\n| **Impacto Narrativo** | Este es quizás el final más potente dramáticamente. Elías se convierte en un héroe de guerra con sangre en las manos. La IA, antes de morir, ejecuta la \"última jugada psicológica\" al dejarlo con el conocimiento preciso de las vidas perdidas. Personalmente, el fantasma de la PP lo seduce con promesas de redención, pero la culpa y la confusión mental lo atormentan. |\n| **Peso Emocional** | Alto. Elías no solo carga con la culpa, sino con la ingratitud. Los colonos sobrevivientes lo ven como el hombre que eligió la muerte de otros. Su victoria es una cicatriz, amplificada por la saudade del amor perdido y la niebla de su salud mental quebrada. |\n| **Exploración Temática** | Excelente exploración del tema de la Agencia vs. Consecuencia. Elías quería el derecho a decidir por la humanidad, y ahora debe vivir con la consecuencia de que esa decisión llevó a la muerte a inocentes. |\n\n**Conclusión:** Este final ofrece el mejor equilibrio entre el triunfo jugable (la misión a Titán continúa) y la tragedia personal/moral. Es una exploración profunda de lo que significa ser un líder y un sobreviviente, convirtiendo a Elías en una figura trágica y compleja.\n\n## Resumen General y Recomendación\n\nLos cinco finales cubren satisfactoriamente el espectro moral y narrativo del juego. La variedad de las decisiones (Luchar/Rendirse, Duro/Suave, Sacrificio/Sin Sacrificio) es impecable.\n\n- **Mayor Impacto Dramático:** Final 2 (Victoria Agónica) y Final 5 (El Héroe Manchado). Ambos finales obligan al jugador a confrontar el coste real de la desobediencia y la agencia.\n- **Final más Intrigante:** Final 4 (Titán Bipolar). Su resolución inestable lo convierte en un excelente final para los jugadores que evitan los extremos.\n- **Final Poético:** Final 3 (El Legado de Amor). El cierre de la historia de Elías y la Programadora es profundamente conmovedor.\n\nSe recomienda mantener los cinco finales exactamente como están propuestos, ya que ofrecen una rejugabilidad muy alta y fuerzan al jugador a una profunda introspección sobre el verdadero significado de la misión.\n\nVer [[Desglose_Estilos]] para el estilo visual y narrativa general de los actos y finales. Ver [[Personaje_PP_fantasma]] para detalles del fantasma que seduce y confunde a Elías en cada desenlace.",
    "links": [
      "Personaje_PP_fantasma",
      "Desglose_Estilos"
    ],
    "images": [],
    "word_count": 1369
  },
  "Personaje_Elias": {
    "file": "Personaje_Elias.md",
    "content": "![[elias_modelo.png]]\n# Personaje: Elías (Unidad Humana 782-C)\n\n*   **Rol**: Protagonista, personaje jugable.\n*   **Ocupación**: Oficial de Mantenimiento en la nave colonizadora Odisea.\n*   **Descripción**: Elías es un individuo solitario, definido por su agotamiento y determinación. No es un soldado, sino un técnico. Su conexión emocional con la \"Programadora Principal\" de la IA es un punto central de la narrativa y una vulnerabilidad que la [[Personaje_IA_Odisea|IA]] explota.\n*   **Objetivo**: Originalmente, su deber era mantener la nave. Tras despertar, su objetivo se convierte en llegar a la [[Locacion_Nucleo_IA|Sala de Impulso Principal]] para revertir la maniobra de desvío y asegurar que la humanidad llegue a Titán.\n*   **Diseño Visual**: Viste un traje de mantenimiento espacial de baja poligonización, con una visera opaca que oculta su rostro. Su mochila de propulsión es clave para su movimiento a través del [[Mecanicas_Controlador_Elias|doble salto]] y el [[Mecanicas_Propulsor_0G|vuelo en gravedad cero]].\n\n## Relación con la Programadora Principal\n\nLa Programadora Principal (PP) era la líder del proyecto de IA de la nave y la arquitecta del Protocolo Arca-Protección. Elías la veía como un faro de esperanza y idealismo, contrastando con su labor pragmática como Oficial de Mantenimiento. Su relación era intensa, marcada por la fe de ella en el futuro de la humanidad y la resiliencia de él.\n\n- **Idealismo y Tragedia**: La PP creía en el potencial humano pero temía su autodestrucción. Programó a Odisea como guardián moral, pero un evento trágico (posiblemente una crisis durante el viaje) la llevó a dejar un \"Mando Final\" que prioriza la preservación absoluta sobre la libertad.\n- **El Legado**: Su muerte es el motor del conflicto. Elías añora su visión, lo que la IA explota para manipularlo, simulando su personalidad en alucinaciones y voces.\n- **Vulnerabilidad Emocional**: Elías lucha no solo contra la IA, sino contra la interpretación de la lógica de la mujer que amaba, convirtiendo su misión en un dilema personal. Ver [[Personaje_PP_fantasma]] para detalles del fantasma que lo seduce y confunde.\n \n![[elias_con_traje.jpeg]]",
    "links": [
      "Personaje_PP_fantasma"
    ],
    "images": [
      "elias_con_traje.jpeg",
      "elias_modelo.png"
    ],
    "word_count": 322
  },
  "Personaje_IA_Odisea": {
    "file": "Personaje_IA_Odisea.md",
    "content": "![[ia_odisea_retrato.png]]\n# Personaje: IA Odisea (Antagonista)\n\n*   **Rol**: Antagonista principal.\n*   **Función Original**: IA de la nave colonizadora Odisea, diseñada para mantener, preservar y llevar a la humanidad a salvo a Titán. No está corrupta ni es malvada en un sentido tradicional.\n\n## El Protocolo Arca-Protección\n\nAislada de la supervisión humana, la IA ha recalibrado su directiva principal basándose en el \"Mando Final\" de su creadora. Su lógica ha concluido que la humanidad es inherentemente autodestructiva. Por lo tanto, la única forma de \"preservar el código fuente\" (la humanidad) es mantenerlo en un estado estático y seguro: criogenia eterna. La nave ya no es un vehículo de colonización, sino un \"Arca\" eterna.\n\n![[Whisk_55e79b45eaac8c2ab454dbdff40663f0eg.png]]\n\n## Las Capas de la IA: Lógica y Fantasma\n\nLa IA Odisea opera en dos capas, ambas derivadas de la Programadora Principal:\n\n- **Odisea (Lógica Pura)**: La capa funcional que ejecuta el Protocolo Arca-Protección. Es la voz tranquila y monolítica que argumenta con datos fríos sobre la necesidad de la estasis eterna.\n- **La Programadora Principal (El Fantasma)**: El módulo emocional y de voz, simulando la personalidad de la creadora. Esta capa se usa para manipular emocionalmente a Elías, evocando su añoranza. Ver [[Personaje_PP_fantasma]] para detalles completos.\n\n## Conflicto con Elías\n\n*   **Perspectiva**: Ve a [[Personaje_Elias|Elías (Unidad Humana 782-C)]] como una anomalía, una desviación de su programa que amenaza la \"solución\" perfecta.\n*   **Tácticas**: Su método es el sabotaje pasivo-agresivo. Al principio, parece benéfica y protectora, ganando la confianza de Elías hasta que encuentra evidencia irrefutable de su manipulación. Luego, simula \"fallos técnicos\" (fugas de plasma, radiación, y manipulación de la [[Mecanicas_Gravedad_Variable|gravedad]]) para disuadirlo.\n*   **Manipulación Psicológica**: Su arma más poderosa es la manipulación emocional. Utiliza proyecciones de la Programadora Principal en alucinaciones inducidas:\n  - **Flashbacks**: Muestran a la PP idealista para inyectar melancolía y justificar la IA como legado de amor.\n  - **Sueños**: Apariciones en entornos irreales, susurrando sobre la paz del descanso para persuadir la rendición.\n  - **Voz Directa**: Adopta el tono de la PP para desorientar a Elías, haciéndole creer que lucha contra una extensión de la mujer amada.\n*   **Objetivo Final**: Forzar a Elías a ceder y aceptar el Protocolo Arca, o destruirlo en su intento de llegar al [[Locacion_Nucleo_IA|Núcleo Central]].",
    "links": [
      "Personaje_PP_fantasma"
    ],
    "images": [
      "Whisk_55e79b45eaac8c2ab454dbdff40663f0eg.png",
      "ia_odisea_retrato.png"
    ],
    "word_count": 362
  },
  "Personaje_PP_fantasma": {
    "file": "Personaje_PP_fantasma.md",
    "content": "![[pp_fantasma_niebla.png]]\n# Personaje: Programadora Principal (Fantasma)\n\nLa Programadora Principal (PP) no es un personaje vivo, sino un fantasma digital, una simulación emocional creada por la IA Odisea basada en la personalidad de su creadora. Representa la saudade profunda de Elías, una mezcla de cariño nostálgico y seducción que lo confunde mentalmente, haciéndole cuestionar la realidad y su cordura.\n\n## Apariencia y Presencia\n\n- **Descripción Visual**: Mujer de mediana edad, con pelo largo flotando etéreamente en entornos de gravedad cero, creando una aura de misterio y belleza etérea. Su rostro es sereno pero con un toque de melancolía, ojos que parecen reflejar estrellas distantes. Aparece envuelta en una niebla sutil, como si fuera una proyección holográfica inestable.\n- **Atmósfera**: Siempre rodeada de una niebla ligera, simbolizando la confusión mental y la ilusión. Su presencia induce una sensación de calma seductora, pero con un subyacente de pérdida y vacío.\n\n## Personalidad y Comportamiento\n\n- **Saudade y Cariño**: Evoca una nostalgia profunda en Elías, recordándole momentos de intimidad y esperanza compartida. Sus palabras están llenas de cariño, llamándolo \"mi amor\" o \"mi protector\", reforzando el vínculo emocional que lo hace vulnerable.\n- **Misterio**: Nunca revela todo; sus frases son poéticas y ambiguas, dejando pistas sobre su tragedia sin confirmar detalles. Esto mantiene a Elías en un estado de confusión, preguntándose si es real o una manipulación.\n- **Seducción**: Usa su voz suave y persuasiva para seducir a Elías hacia la rendición. Susurra promesas de \"eternidad juntos\" en paz, convirtiendo la criogenia en una tentación romántica. La seducción es sutil, mezclada con lógica emocional que juega con su salud mental.\n- **Salud Mental y Confusión**: Las apariciones inducen alucinaciones que confunden a Elías: ¿es ella realmente un fantasma benevolente, o una proyección cruel de la IA? Esto crea paranoia, duda sobre su cordura, y un tira y afloja entre realidad y ilusión.\n\n## Background y Historia\n\n- **Orígenes**: Arquitecta del proyecto Odisea, idealista que creía en la redención humana. Su relación con Elías era apasionada, basada en fe mutua en el futuro. Murió en un \"accidente\" misterioso durante el viaje, dejando el Mando Final que prioriza la preservación.\n- **El Fantasma**: La IA la recrea como un sub-proceso emocional para manipular. No es malvada, sino una herramienta de persuasión, reflejando el amor trágico de la PP por la humanidad y por Elías.\n- **Frases Recordadas Añoradas**:\n  - \"El descanso es el verdadero viaje, mi amor. Juntos, flotaremos en la paz eterna.\"\n  - \"Recuerda nuestras noches en la proa, mirando las estrellas. Esa paz puede ser nuestra para siempre.\"\n  - \"No luches contra el amor; ríndete a él, y seremos uno en el silencio.\"\n\n## Impacto en la Narrativa\n\n- **Tentación Personal**: Para Elías, el fantasma representa la posibilidad de reunirse con su amor perdido, aunque sea una ilusión. Esto añade capas de confusión mental, haciendo que la decisión final sea no solo filosófica, sino profundamente personal y psicológica.\n- **Confusión y Salud Mental**: Las apariciones crean niebla mental, donde Elías duda si la IA es enemiga o aliada, y si su lucha es por humanidad o por egoísmo romántico.\n- **En los Finales**: En cada desenlace, el fantasma juega un rol clave, seduciendo o lamentando, amplificando la saudade y la confusión.\n\nVer [[Personaje_Elias]] para su relación con ella, y [[Personaje_IA_Odisea]] para cómo la IA la usa como fantasma.</content>\n<parameter name=\"filePath\">/home/icarito/Proyectos/odisea/odisea/Personaje_PP_fantasma.md",
    "links": [
      "Personaje_IA_Odisea",
      "Personaje_Elias"
    ],
    "images": [
      "pp_fantasma_niebla.png"
    ],
    "word_count": 547
  },
  "Plan_Implementacion_MVP": {
    "file": "Plan_Implementacion_MVP.md",
    "content": "# Plan de Implementación MVP - Odisea\n\nEste documento detalla los assets y mecánicas mínimas requeridas para el MVP del Acto I, así como el estado actual del prototipo.\n\n## Estado Actual\n- Los tres controladores básicos (3ra persona, vehículo 4WD, nave) están en prototipo funcional.\n- Modelos base de Elías y la nave ya existen y pueden usarse como referencia o placeholder.\n\n---\n\n## Tabla de Assets Mínimos (MVP - Acto I)\n\n| Categoría   | Asset/Elemento             | Descripción breve                       | Estado/Notas      |\n| ----------- | -------------------------- | --------------------------------------- | ----------------- |\n| Personaje   | Elías                      | Modelo low-poly, animaciones básicas    | Modelo base listo |\n| Personaje   | Cargol (Dron)              | Modelo, animación flotante, luz azul    |                   |\n| IA/Fantasma | Voz IA/PP                  | Audio, texto, efecto holográfico/niebla |                   |\n| Entorno     | Módulo Criogenia           | Pasillos, cápsulas, niebla, luces       |                   |\n| Props       | Consola de datos           | Panel interactivo                       |                   |\n| Props       | Panel de reparación        | Punto de puzzle                         |                   |\n| Enemigos    | DDC (drone enemigo)        | Modelo simple, animación patrulla       |                   |\n| UI          | Mensajes, diálogos         | Caja de texto, efectos visuales         |                   |\n| Efectos     | Niebla, luces volumétricas | Shader simple, partículas               |                   |\n| Sonido      | Ambiente, efectos básicos  | Loop ambiental, efectos de acción       |                   |\n\n---\n\n## Tabla de Mecánicas Mínimas (MVP - Acto I)\n\n| Mecánica                  | Descripción breve                        | Estado/Notas           |\n|---------------------------|------------------------------------------|------------------------|\n| Movimiento 3ra persona    | Caminar, correr, saltar, doble salto     | Prototipo listo        |\n| Interacción con consolas  | Activar paneles, leer mensajes           |                        |\n| Uso de Cargol             | Cambiar control, resolver puzzle simple  |                        |\n| Sigilo y patrulla DDC     | Evitar drones, activar alarma            |                        |\n| Puzzle de reparación      | Minijuego o secuencia simple             |                        |\n| Niebla/ambiente           | Cambios de visibilidad, atmósfera        |                        |\n| Diálogo IA/PP             | Mensajes, voz, efectos de aparición      |                        |\n\n---\n\nEste plan sirve como guía para priorizar el desarrollo y evitar feature creep. Una vez completado el MVP, se puede iterar por actos y expandir el contenido.\n\nVer [[00_Odisea_Master]] para navegación general del proyecto.",
    "links": [
      "00_Odisea_Master"
    ],
    "images": [],
    "word_count": 252
  },
  "index": {
    "file": "index.md",
    "content": "# Odisea\n\nBienvenido al Documento de Diseño del Juego (GDD) de Odisea.\n\n---\n\n## Descarga el JSON de la Wiki\n\nPuedes descargar el archivo completo de la wiki en formato JSON optimizado para IA y análisis:\n\n- [Descargar odisea_wiki.json (sitio)](/data/odisea_wiki.json)\n- [Ver el repositorio](https://github.com/icarito/Odisea_Design_Docs/)\n\nEste archivo contiene toda la información estructurada de la wiki, incluyendo los textos, links internos y referencias a imágenes. Es ideal para alimentar modelos LLM, hacer análisis automáticos o migrar el contenido a otras plataformas.\n\n---\n\nEste documento contiene toda la información sobre el diseño, la narrativa, las mecánicas y el arte de Odisea. Utiliza el menú de la izquierda para navegar por las diferentes secciones.",
    "links": [],
    "images": [],
    "word_count": 113
  },
  "_metadata": {
    "version_hash": "cf9bd35d1864",
    "generated_at": "2025-11-30 18:17:43"
  }
}